In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame(columns=['col1','col2','col3'],
                index=['A','B','C','D','E'],
                data=np.random.randint(10,50,(5,3)))
df

   col1  col2  col3
A    46    16    40
B    35    31    43
C    11    23    18
D    23    41    44
E    30    44    23

In [12]:
df[['col1','col2']]

   col1  col2
A    41    44
B    33    23
C    21    31
D    49    38
E    41    47

In [14]:
df.loc[['A','B']]

   col1  col2  col3
A    41    44    16
B    33    23    33

In [17]:
df.iloc[[0]]

   col1  col2  col3
A    41    44    16

In [25]:
df.iloc[[0,1,2,3,4]][['col2']]

   col2
A    44
B    23
C    31
D    38
E    47

In [27]:
df.iloc[:,0:1]

   col1
A    41
B    33
C    21
D    49
E    41

In [29]:
df.iloc[[0,2,4]]

   col1  col2  col3
A    41    44    16
C    21    31    35
E    41    47    48

In [31]:
df.iloc[:5:2,:]                              # row, column

   col1  col2  col3
A    41    44    16
C    21    31    35
E    41    47    48

In [33]:
df.iloc[:5:2,0:1]

   col1
A    41
C    21
E    41

In [35]:
df.iloc[:5:2,:][['col1']]

   col1
A    41
C    21
E    41

In [38]:
df.iloc[1:3:1,1:3]

   col2  col3
B    23    33
C    31    35

In [40]:
df[['col2','col3']].loc[['B','C']]

   col2  col3
B    23    33
C    31    35

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int32
 1   col2    5 non-null      int32
 2   col3    5 non-null      int32
dtypes: int32(3)
memory usage: 272.0+ bytes

In [44]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [46]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [49]:
df.shape

(5, 3)

In [51]:
type(df.values)

numpy.ndarray

In [56]:
df['col1']+3

A    44
B    36
C    24
D    52
E    44
Name: col1, dtype: int32

In [58]:
df['col1']-4

A    37
B    29
C    17
D    45
E    37
Name: col1, dtype: int32

In [60]:
df['col1']*2

A    82
B    66
C    42
D    98
E    82
Name: col1, dtype: int32

In [62]:
df['col1']+df['col2']

A    85
B    56
C    52
D    87
E    88
dtype: int32

In [69]:
df[df['col1']>40][['col1']]

   col1
A    41
D    49
E    41

In [71]:
df[df['col2']>20][['col2']]

   col2
A    44
B    23
C    31
D    38
E    47

In [79]:
df[(df['col2']>20) & (df['col2']<50)][['col2']]

   col2
A    44
B    23
C    31
D    38
E    47

In [82]:
df[(df['col2']%2==0) | (df['col2']%5==0)][['col2']]

   col2
A    44
D    38

In [86]:
df['col1'].sum()

185

In [88]:
df['col1'].min()

21

In [4]:
df['col1'].max()

46

In [28]:
s2=pd.Series(['A','B','C','A','B','C','D','E'],name='grade')
s2

0    A
1    B
2    C
3    A
4    B
5    C
6    D
7    E
Name: grade, dtype: object

In [10]:
s2.value_counts()

A    2
B    2
C    2
D    1
E    1
Name: grade, dtype: int64

In [22]:
def convert(gd):
    d={'A':10,'B':8,'C':7,'D':5,'E':9}
    return d[gd]

In [29]:
s2=s2.apply(convert)

In [30]:
s2

0    10
1     8
2     7
3    10
4     8
5     7
6     5
7     9
Name: grade, dtype: int64

In [36]:
s4= pd.Series(["pune","mumbai","delhi","chennai","nagpur"],name='city')

In [37]:
s4

0       pune
1     mumbai
2      delhi
3    chennai
4     nagpur
Name: city, dtype: object

In [41]:
def dvert(ct):
    return ct.upper()

In [39]:
s4=s4.apply(dvert)

In [42]:
s4

0       PUNE
1     MUMBAI
2      DELHI
3    CHENNAI
4     NAGPUR
Name: city, dtype: object

In [45]:
s4.apply(lambda ct:ct.upper())

0       PUNE
1     MUMBAI
2      DELHI
3    CHENNAI
4     NAGPUR
Name: city, dtype: object

In [47]:
s4.apply(lambda ct:ct[0:2])

0    PU
1    MU
2    DE
3    CH
4    NA
Name: city, dtype: object